---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SheetAssemblyAssemblyDescription
source: html/f18f2ee9-c9b2-4aea-6138-60ea61ae96c3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SheetAssemblyAssemblyDescription Property

"Assembly: Assembly Description"

## Syntax (C#)
```csharp
public static ForgeTypeId SheetAssemblyAssemblyDescription { get; }
```